tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "fontconfig"
brew "gettext"
brew "cairo"
brew "cmake"
brew "curl"
brew "docker"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "ghostscript"
brew "git"
brew "glslviewer"
brew "grafana", restart_service: :changed
brew "luarocks"
brew "neovim"
brew "ninja"
brew "nmap"
brew "openblas"
brew "numpy"
brew "pkgconf"
brew "projectm"
brew "prometheus"
brew "protobuf"
brew "py3cairo"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "scipy"
brew "spotify_player"
brew "tmux"
brew "hashicorp/tap/terraform"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "mactex"
cask "iterm2"

